Revit 2026 API

# LoadBaseIsHosted Property

---

Indicates if the Load is hosted or non-hosted.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsHosted { get; }
```
```vb
Public ReadOnly Property IsHosted As Boolean
	Get
```
```cpp
public:
property bool IsHosted {
	bool get ();
}
```
```fsharp
member IsHosted : bool with get
```

#### Property Value

Boolean

True is returned when load is hosted. False is returned load is non-hosted. To determine if load is hosted HostElementId property or [!:Autodesk::Revit::DB::Structure::LoadBase::HostElement] property may also be used.

#### Reference

LoadBase Class

Autodesk.Revit.DB.Structure Namespace